FeatherCore/nuttx/boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
/****************************************************************************
 * boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>

#include <debug.h>
#include <nuttx/arch.h>
#include <nuttx/fs/fs.h>

#include <arch/board/board.h>

#include "stm32_gpio.h"
#include "stm32_xspi.h"
#include "stm32u5x9j-dk.h"

#if defined(CONFIG_STM32U5X9J_DK_OSPI_NOR) || \
    defined(CONFIG_STM32U5X9J_DK_HSPI_RAM)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define STM32U5X9J_OSPI_PRESCALER           1u
#define STM32U5X9J_OSPI_CSHT                2u
#define STM32U5X9J_OSPI_FIFO_THRESHOLD      4u
#define STM32U5X9J_OSPI_DIAG_PATH           "/dev/ospi0"

#define MX25UM51245G_FLASH_SIZE             STM32U5X9J_OSPI1_NOR_SIZE
#define MX25UM51245G_ERASE_SIZE             (64u * 1024u)
#define MX25UM51245G_SUBSECTOR_SIZE         (4u * 1024u)
#define MX25UM51245G_PAGE_SIZE              256u
#define MX25UM51245G_DEVSIZE                25u
#define MX25UM51245G_MANUFACTURER_ID        0xc2u
#define MX25UM51245G_READ_ID_CMD            0x9fu
#define MX25UM51245G_WRITE_ENABLE_CMD       0x06u
#define MX25UM51245G_READ_STATUS_CMD        0x05u
#define MX25UM51245G_RESET_ENABLE_CMD       0x66u
#define MX25UM51245G_RESET_MEMORY_CMD       0x99u
#define MX25UM51245G_OCTA_RESET_ENABLE_CMD  0x6699u
#define MX25UM51245G_OCTA_RESET_MEMORY_CMD  0x9966u
#define MX25UM51245G_FAST_READ_4B_CMD       0x0cu
#define MX25UM51245G_FAST_READ_DUMMY        8u
#define MX25UM51245G_SUBSECTOR_ERASE_4B_CMD 0x21u
#define MX25UM51245G_PAGE_PROGRAM_4B_CMD    0x12u
#define MX25UM51245G_SUSPEND_CMD            0xb0u
#define MX25UM51245G_RESUME_CMD             0x30u
#define MX25UM51245G_STATUS_WIP             (1u << 0)
#define MX25UM51245G_RESET_DELAY_MS         100u
#define MX25UM51245G_READY_TIMEOUT_MS       5000u

#define STM32U5X9J_HSPI_PRESCALER           0u
#define STM32U5X9J_HSPI_CSHT                1u
#define STM32U5X9J_HSPI_FIFO_THRESHOLD      2u
#define STM32U5X9J_HSPI_MAXTRAN             0u
#define STM32U5X9J_HSPI_CSBOUND             11u
#define STM32U5X9J_HSPI_DIAG_PATH           "/dev/hspiram0"

#define APS512XX_RAM_SIZE                   STM32U5X9J_HSPI1_PSRAM_SIZE
#define APS512XX_FB_RESERVED                STM32U5X9J_HSPI1_PSRAM_FB_SIZE
#define APS512XX_HEAP_BASE                  STM32U5X9J_HSPI1_PSRAM_HEAP_BASE
#define APS512XX_HEAP_SIZE                  STM32U5X9J_HSPI1_PSRAM_HEAP_SIZE
#define APS512XX_DEVSIZE                    25u
#define APS512XX_RESET_CMD                  0xffu
#define APS512XX_READ_LINEAR_BURST_CMD      0x20u
#define APS512XX_WRITE_LINEAR_BURST_CMD     0xa0u
#define APS512XX_READ_REG_CMD               0x40u
#define APS512XX_WRITE_REG_CMD              0xc0u
#define APS512XX_MR0_ADDRESS                0x00000000u
#define APS512XX_MR4_ADDRESS                0x00000004u
#define APS512XX_MR8_ADDRESS                0x00000008u
#define APS512XX_MR0_VALUE                  0x09u
#define APS512XX_MR4_VALUE                  0x40u
#define APS512XX_MR8_VALUE                  0x41u
#define APS512XX_REG_LATENCY                4u
#define APS512XX_READ_LATENCY               5u
#define APS512XX_WRITE_LATENCY              5u

#if defined(CONFIG_STM32U5X9J_DK_OSPI_SCRATCH_TEST)
#  define HAVE_STM32U5X9J_OSPI_WRITE_CMDS   1
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#if defined(CONFIG_STM32U5X9J_DK_OSPI_DIAG) || \
    defined(CONFIG_STM32U5X9J_DK_HSPI_DIAG)
static ssize_t stm32u5x9j_diag_copyout(FAR struct file *filep,
                                       FAR char *buffer, size_t buflen,
                                       FAR const char *text);
#endif

#ifdef CONFIG_STM32U5X9J_DK_OSPI_NOR
static int stm32u5x9j_ospi_enter_memory_mapped(void);
#ifdef CONFIG_STM32U5X9J_DK_OSPI_DIAG
static ssize_t stm32u5x9j_ospi_diag_read(FAR struct file *filep,
                                         FAR char *buffer, size_t buflen);
static ssize_t stm32u5x9j_ospi_diag_write(FAR struct file *filep,
                                          FAR const char *buffer,
                                          size_t buflen);
static int stm32u5x9j_ospi_diag_register(void);
#endif
#endif

#ifdef CONFIG_STM32U5X9J_DK_HSPI_DIAG
static ssize_t stm32u5x9j_hspi_diag_read(FAR struct file *filep,
                                         FAR char *buffer, size_t buflen);
static ssize_t stm32u5x9j_hspi_diag_write(FAR struct file *filep,
                                          FAR const char *buffer,
                                          size_t buflen);
static int stm32u5x9j_hspi_diag_register(void);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_STM32U5X9J_DK_OSPI_NOR
static uint8_t g_ospi_jedec[3];

#ifdef CONFIG_STM32U5X9J_DK_OSPI_DIAG
static bool g_ospi_diag_registered;
static int g_ospi_last_scratch = -ENOTSUP;

static const struct file_operations g_ospi_diag_fops =
{
  NULL,                         /* open */
  NULL,                         /* close */
  stm32u5x9j_ospi_diag_read,    /* read */
  stm32u5x9j_ospi_diag_write,   /* write */
};
#endif
#endif

#ifdef CONFIG_STM32U5X9J_DK_HSPI_RAM
static bool g_hspi_ram_mapped;

#ifdef CONFIG_STM32U5X9J_DK_HSPI_DIAG
static bool g_hspi_diag_registered;
static int g_hspi_last_selftest = -ENODEV;

