FeatherCore/nuttx/boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
static const struct file_operations g_hspi_diag_fops =
{
  NULL,                         /* open */
  NULL,                         /* close */
  stm32u5x9j_hspi_diag_read,    /* read */
  stm32u5x9j_hspi_diag_write,   /* write */
};
#endif
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#if defined(CONFIG_STM32U5X9J_DK_OSPI_DIAG) || \
    defined(CONFIG_STM32U5X9J_DK_HSPI_DIAG)
static ssize_t stm32u5x9j_diag_copyout(FAR struct file *filep,
                                       FAR char *buffer, size_t buflen,
                                       FAR const char *text)
{
  size_t len;
  size_t ncopy;

  if (buflen == 0)
    {
      return 0;
    }

  len = strlen(text);
  if (filep->f_pos >= len)
    {
      return 0;
    }

  ncopy = MIN(buflen, len - filep->f_pos);
  memcpy(buffer, &text[filep->f_pos], ncopy);
  filep->f_pos += ncopy;

  return ncopy;
}
#endif

#ifdef CONFIG_STM32U5X9J_DK_OSPI_NOR
static bool stm32u5x9j_ospi_id_blank(FAR const uint8_t id[3])
{
  return (id[0] == 0x00 && id[1] == 0x00 && id[2] == 0x00) ||
         (id[0] == 0xff && id[1] == 0xff && id[2] == 0xff);
}

static void stm32u5x9j_ospi_gpio_config(void)
{
  stm32_configgpio(GPIO_OSPI1_CLK);
  stm32_configgpio(GPIO_OSPI1_DQS);
  stm32_configgpio(GPIO_OSPI1_NCS);
  stm32_configgpio(GPIO_OSPI1_IO0);
  stm32_configgpio(GPIO_OSPI1_IO1);
  stm32_configgpio(GPIO_OSPI1_IO2);
  stm32_configgpio(GPIO_OSPI1_IO3);
  stm32_configgpio(GPIO_OSPI1_IO4);
  stm32_configgpio(GPIO_OSPI1_IO5);
  stm32_configgpio(GPIO_OSPI1_IO6);
  stm32_configgpio(GPIO_OSPI1_IO7);
}

static int stm32u5x9j_ospi_readid(FAR uint8_t id[3])
{
  return stm32_xspi_read_data(STM32_XSPI_PORT_OCTOSPI1,
                              MX25UM51245G_READ_ID_CMD, 0,
                              XSPI_CCR_IMODE_1_LINE |
                              XSPI_CCR_DMODE_1_LINE,
                              0, 3, id);
}

static void stm32u5x9j_ospi_reset_opi(bool dtr)
{
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ISIZE_16;
  if (dtr)
    {
      ccr |= XSPI_CCR_IDTR;
    }

  ret = stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                           MX25UM51245G_OCTA_RESET_ENABLE_CMD, ccr);
  if (ret < 0)
    {
      return;
    }

  ret = stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                           MX25UM51245G_OCTA_RESET_MEMORY_CMD, ccr);
  if (ret >= 0)
    {
      up_mdelay(MX25UM51245G_RESET_DELAY_MS);
    }
}

static int stm32u5x9j_ospi_reset_spi(void)
{
  int ret;

  ret = stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                           MX25UM51245G_RESET_ENABLE_CMD,
                           XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                           MX25UM51245G_RESET_MEMORY_CMD,
                           XSPI_CCR_IMODE_1_LINE);
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(MX25UM51245G_RESET_DELAY_MS);
  return OK;
}

#ifdef HAVE_STM32U5X9J_OSPI_WRITE_CMDS
static int stm32u5x9j_ospi_read_status(FAR uint8_t *status)
{
  return stm32_xspi_read_data(STM32_XSPI_PORT_OCTOSPI1,
                              MX25UM51245G_READ_STATUS_CMD, 0,
                              XSPI_CCR_IMODE_1_LINE |
                              XSPI_CCR_DMODE_1_LINE,
                              0, 1, status);
}

static int stm32u5x9j_ospi_write_enable(void)
{
  return stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                            MX25UM51245G_WRITE_ENABLE_CMD,
                            XSPI_CCR_IMODE_1_LINE);
}

static int stm32u5x9j_ospi_wait_ready(void)
{
  uint32_t remaining = MX25UM51245G_READY_TIMEOUT_MS;
  uint8_t status;
  int ret;

  do
    {
      ret = stm32u5x9j_ospi_read_status(&status);
      if (ret < 0)
        {
          return ret;
        }

      if ((status & MX25UM51245G_STATUS_WIP) == 0)
        {
          return OK;
        }

      up_mdelay(1);
    }
  while (remaining-- > 0);

  return -ETIMEDOUT;
}

static int stm32u5x9j_ospi_erase_subsector(uint32_t address)
{
  int ret;

  ret = stm32u5x9j_ospi_write_enable();
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32_xspi_command_addr(STM32_XSPI_PORT_OCTOSPI1,
                                MX25UM51245G_SUBSECTOR_ERASE_4B_CMD,
                                address,
                                XSPI_CCR_IMODE_1_LINE |
                                XSPI_CCR_ADMODE_1_LINE |
                                XSPI_CCR_ADSIZE_32,
                                0);
  if (ret < 0)
    {
      return ret;
    }

  return stm32u5x9j_ospi_wait_ready();
}

static int stm32u5x9j_ospi_page_program(uint32_t address,
                                        FAR const uint8_t *buffer,
                                        size_t nbytes)
{
  int ret;

  if (nbytes == 0 || nbytes > MX25UM51245G_PAGE_SIZE)
    {
      return -EINVAL;
    }

  ret = stm32u5x9j_ospi_write_enable();
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32_xspi_write_buffer(STM32_XSPI_PORT_OCTOSPI1,
                                MX25UM51245G_PAGE_PROGRAM_4B_CMD,
                                address,
                                XSPI_CCR_IMODE_1_LINE |
                                XSPI_CCR_ADMODE_1_LINE |
                                XSPI_CCR_ADSIZE_32 |
                                XSPI_CCR_DMODE_1_LINE,
                                0, nbytes, buffer);
  if (ret < 0)
    {
      return ret;
    }

  return stm32u5x9j_ospi_wait_ready();
}
#endif

static int stm32u5x9j_ospi_enter_memory_mapped(void)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_1_LINE | XSPI_CCR_ADMODE_1_LINE |
        XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_1_LINE;

  return stm32_xspi_enter_memory_mapped(STM32_XSPI_PORT_OCTOSPI1, ccr,
                                        XSPI_TCR_DCYC(
                                          MX25UM51245G_FAST_READ_DUMMY),
                                        MX25UM51245G_FAST_READ_4B_CMD);
}

#ifdef CONFIG_STM32U5X9J_DK_OSPI_DIAG
static int stm32u5x9j_ospi_suspend(void)
{
  return stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                            MX25UM51245G_SUSPEND_CMD,
                            XSPI_CCR_IMODE_1_LINE);
}

static int stm32u5x9j_ospi_resume(void)
{
  return stm32_xspi_command(STM32_XSPI_PORT_OCTOSPI1,
                            MX25UM51245G_RESUME_CMD,
                            XSPI_CCR_IMODE_1_LINE);
}

