FeatherCore/nuttx/boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
#ifdef CONFIG_STM32U5X9J_DK_OSPI_SCRATCH_TEST
static int stm32u5x9j_ospi_scratch_test(void)
{
  uint8_t pattern[MX25UM51245G_PAGE_SIZE];
  uint32_t offset = CONFIG_STM32U5X9J_DK_OSPI_SCRATCH_OFFSET;
  FAR const uint8_t *xip;
  size_t i;
  int ret;

  if ((offset & (MX25UM51245G_SUBSECTOR_SIZE - 1)) != 0 ||
      offset + MX25UM51245G_SUBSECTOR_SIZE > MX25UM51245G_FLASH_SIZE)
    {
      return -EINVAL;
    }

  for (i = 0; i < sizeof(pattern); i++)
    {
      pattern[i] = (uint8_t)(0xa5u ^ i);
    }

  ret = stm32_xspi_abort(STM32_XSPI_PORT_OCTOSPI1);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_ospi_erase_subsector(offset);
  if (ret < 0)
    {
      (void)stm32u5x9j_ospi_enter_memory_mapped();
      return ret;
    }

  ret = stm32u5x9j_ospi_page_program(offset, pattern, sizeof(pattern));
  if (ret < 0)
    {
      (void)stm32u5x9j_ospi_enter_memory_mapped();
      return ret;
    }

  ret = stm32u5x9j_ospi_enter_memory_mapped();
  if (ret < 0)
    {
      return ret;
    }

  xip = (FAR const uint8_t *)(STM32U5X9J_OSPI1_NOR_MEM_BASE + offset);
  for (i = 0; i < sizeof(pattern); i++)
    {
      if (xip[i] != pattern[i])
        {
          return -EIO;
        }
    }

  return OK;
}
#endif

static ssize_t stm32u5x9j_ospi_diag_read(FAR struct file *filep,
                                         FAR char *buffer, size_t buflen)
{
  FAR const volatile uint32_t *xip =
    (FAR const volatile uint32_t *)STM32U5X9J_OSPI1_NOR_MEM_BASE;
  char text[512];
  int len;

  len = snprintf(text, sizeof(text),
                 "mx25um51245g size=%u erase64k=%u erase4k=%u page=%u\n"
                 "jedec=%02x %02x %02x manufacturer_ok=%u\n"
                 "xip_base=0x%08x xip_first=0x%08" PRIx32 "\n"
#ifdef CONFIG_STM32U5X9J_DK_OSPI_MTD
                 "mtd=/dev/mtd0 mode=read-only filesystem=none\n"
#else
                 "mtd=disabled filesystem=none\n"
#endif
                 "suspend_resume=spi scratch=%s last_scratch=%d\n",
                 MX25UM51245G_FLASH_SIZE, MX25UM51245G_ERASE_SIZE,
                 MX25UM51245G_SUBSECTOR_SIZE, MX25UM51245G_PAGE_SIZE,
                 g_ospi_jedec[0], g_ospi_jedec[1], g_ospi_jedec[2],
                 g_ospi_jedec[0] == MX25UM51245G_MANUFACTURER_ID,
                 STM32U5X9J_OSPI1_NOR_MEM_BASE, *xip,
#ifdef CONFIG_STM32U5X9J_DK_OSPI_SCRATCH_TEST
                 "enabled",
#else
                 "disabled",
#endif
                 g_ospi_last_scratch);

  if (len < 0)
    {
      return len;
    }

  return stm32u5x9j_diag_copyout(filep, buffer, buflen, text);
}

static ssize_t stm32u5x9j_ospi_diag_write(FAR struct file *filep,
                                          FAR const char *buffer,
                                          size_t buflen)
{
  char cmd[16];
  size_t ncopy;
  int ret;

  ncopy = MIN(buflen, sizeof(cmd) - 1);
  memcpy(cmd, buffer, ncopy);
  cmd[ncopy] = '\0';

  if (strncmp(cmd, "suspend", 7) == 0)
    {
      ret = stm32_xspi_abort(STM32_XSPI_PORT_OCTOSPI1);
      if (ret < 0)
        {
          return ret;
        }

      ret = stm32u5x9j_ospi_suspend();
      (void)stm32u5x9j_ospi_enter_memory_mapped();
      return ret < 0 ? ret : (ssize_t)buflen;
    }

  if (strncmp(cmd, "resume", 6) == 0)
    {
      ret = stm32_xspi_abort(STM32_XSPI_PORT_OCTOSPI1);
      if (ret < 0)
        {
          return ret;
        }

      ret = stm32u5x9j_ospi_resume();
      (void)stm32u5x9j_ospi_enter_memory_mapped();
      return ret < 0 ? ret : (ssize_t)buflen;
    }

  if (strncmp(cmd, "scratch", 7) == 0)
    {
#ifdef CONFIG_STM32U5X9J_DK_OSPI_SCRATCH_TEST
      ret = stm32u5x9j_ospi_scratch_test();
      g_ospi_last_scratch = ret;
      return ret < 0 ? ret : (ssize_t)buflen;
#else
      g_ospi_last_scratch = -ENOTSUP;
      return -ENOTSUP;
#endif
    }

  return -EINVAL;
}

static int stm32u5x9j_ospi_diag_register(void)
{
  int ret;

  if (g_ospi_diag_registered)
    {
      return OK;
    }

  ret = register_driver(STM32U5X9J_OSPI_DIAG_PATH, &g_ospi_diag_fops,
                        0666, NULL);
  if (ret < 0)
    {
      return ret;
    }

  g_ospi_diag_registered = true;
  syslog(LOG_INFO, "stm32u5x9j: OSPI1 NOR diagnostic at %s\n",
         STM32U5X9J_OSPI_DIAG_PATH);

  return OK;
}
#endif /* CONFIG_STM32U5X9J_DK_OSPI_DIAG */
#endif /* CONFIG_STM32U5X9J_DK_OSPI_NOR */

#ifdef CONFIG_STM32U5X9J_DK_HSPI_RAM
static uint32_t stm32u5x9j_psram_refresh(uint32_t prescaler)
{
  uint32_t hspi_hz;
  uint32_t cycles;

  hspi_hz = STM32_SYSCLK_FREQUENCY / (prescaler + 1u);
  cycles = 2u * (hspi_hz / 1000000u);

  return cycles > 4u ? cycles - 4u : 0u;
}

static void stm32u5x9j_hspi_gpio_config(void)
{
  stm32_configgpio(GPIO_HSPI1_CLK);
  stm32_configgpio(GPIO_HSPI1_NCLK);
  stm32_configgpio(GPIO_HSPI1_DQS0);
  stm32_configgpio(GPIO_HSPI1_DQS1);
  stm32_configgpio(GPIO_HSPI1_NCS);
  stm32_configgpio(GPIO_HSPI1_D0);
  stm32_configgpio(GPIO_HSPI1_D1);
  stm32_configgpio(GPIO_HSPI1_D2);
  stm32_configgpio(GPIO_HSPI1_D3);
  stm32_configgpio(GPIO_HSPI1_D4);
  stm32_configgpio(GPIO_HSPI1_D5);
  stm32_configgpio(GPIO_HSPI1_D6);
  stm32_configgpio(GPIO_HSPI1_D7);
  stm32_configgpio(GPIO_HSPI1_D8);
  stm32_configgpio(GPIO_HSPI1_D9);
  stm32_configgpio(GPIO_HSPI1_D10);
  stm32_configgpio(GPIO_HSPI1_D11);
  stm32_configgpio(GPIO_HSPI1_D12);
  stm32_configgpio(GPIO_HSPI1_D13);
  stm32_configgpio(GPIO_HSPI1_D14);
  stm32_configgpio(GPIO_HSPI1_D15);
}

static int stm32u5x9j_psram_write_reg(uint32_t address, uint8_t value)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR;

  return stm32_xspi_write_data(STM32_XSPI_PORT_HSPI1,
                               APS512XX_WRITE_REG_CMD, address,
                               ccr, 0, value, 2, true);
}

static int stm32u5x9j_psram_read_reg(uint32_t address, FAR uint8_t *value)
{
  uint8_t buf[2];
  uint32_t ccr;
  int ret;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_8_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  ret = stm32_xspi_read_data(STM32_XSPI_PORT_HSPI1,
                             APS512XX_READ_REG_CMD, address,
                             ccr, XSPI_TCR_DCYC(APS512XX_REG_LATENCY - 1),
                             sizeof(buf), buf);
  if (ret < 0)
    {
      return ret;
    }

