FeatherCore/nuttx/boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
  *value = buf[0];
  return OK;
}

static int stm32u5x9j_psram_config_reg(uint32_t address, uint8_t value,
                                       uint8_t mask)
{
  uint8_t initial;
  uint8_t readback;
  uint8_t writeval;
  int ret;

  ret = stm32u5x9j_psram_read_reg(address, &initial);
  if (ret < 0)
    {
      return ret;
    }

  writeval = (initial & ~mask) | (value & mask);
  ret = stm32u5x9j_psram_write_reg(address, writeval);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_psram_read_reg(address, &readback);
  if (ret < 0)
    {
      return ret;
    }

  if ((readback & mask) != (value & mask))
    {
      syslog(LOG_ERR, "stm32u5x9j: HSPI1 PSRAM MR%08" PRIx32
             " initial %02x write %02x readback %02x expected %02x\n",
             address, initial, writeval, readback, value);
      return -EIO;
    }

  syslog(LOG_INFO, "stm32u5x9j: HSPI1 PSRAM MR%08" PRIx32
         " initial %02x write %02x readback %02x\n",
         address, initial, writeval, readback);
  return OK;
}

static int stm32u5x9j_psram_enter_memory_mapped(void)
{
  uint32_t ccr;

  ccr = XSPI_CCR_IMODE_8_LINES | XSPI_CCR_ADMODE_8_LINES |
        XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE_32 | XSPI_CCR_DMODE_16_LINES |
        XSPI_CCR_DDTR | XSPI_CCR_DQSE;

  return stm32_xspi_enter_memory_mapped_rw(STM32_XSPI_PORT_HSPI1,
                                           ccr,
                                           XSPI_TCR_DCYC(
                                             APS512XX_READ_LATENCY - 1),
                                           APS512XX_READ_LINEAR_BURST_CMD,
                                           ccr,
                                           XSPI_TCR_DCYC(
                                             APS512XX_WRITE_LATENCY - 1),
                                           APS512XX_WRITE_LINEAR_BURST_CMD);
}

static int stm32u5x9j_psram_selftest(void)
{
  volatile uint32_t *mem =
    (volatile uint32_t *)STM32U5X9J_HSPI1_PSRAM_MEM_BASE;
  uint32_t saved[8];
  uint32_t pattern[8] =
    {
      0x55aa55aau, 0xaa55aa55u, 0x01234567u, 0x89abcdefu,
      0xf0f00f0fu, 0x0f0ff0f0u, 0x13579bdfu, 0x2468ace0u
    };

  int i;

  for (i = 0; i < nitems(saved); i++)
    {
      saved[i] = mem[i];
    }

  for (i = 0; i < nitems(pattern); i++)
    {
      mem[i] = pattern[i];
    }

  for (i = 0; i < nitems(pattern); i++)
    {
      if (mem[i] != pattern[i])
        {
          while (i-- > 0)
            {
              mem[i] = saved[i];
            }

          return -EIO;
        }
    }

  for (i = 0; i < nitems(saved); i++)
    {
      mem[i] = saved[i];
    }

  syslog(LOG_INFO, "stm32u5x9j: HSPI1 PSRAM self-test passed\n");
  return OK;
}

#ifdef CONFIG_STM32U5X9J_DK_HSPI_DIAG
static ssize_t stm32u5x9j_hspi_diag_read(FAR struct file *filep,
                                         FAR char *buffer, size_t buflen)
{
  char text[384];
  int len;

  len = snprintf(text, sizeof(text),
                 "aps512xx base=0x%08x size=%u mapped=%u\n"
                 "framebuffer base=0x%08x size=%u\n"
                 "heap base=0x%08x size=%u enabled=%u\n"
                 "selftest=save-write-read-restore-32B last=%d\n",
                 STM32U5X9J_HSPI1_PSRAM_MEM_BASE, APS512XX_RAM_SIZE,
                 stm32u5x9j_hspi1_psram_is_mapped(),
                 STM32U5X9J_HSPI1_PSRAM_MEM_BASE, APS512XX_FB_RESERVED,
                 APS512XX_HEAP_BASE, APS512XX_HEAP_SIZE,
#ifdef CONFIG_STM32U5X9J_DK_HSPI_HEAP
                 1,
#else
                 0,
#endif
                 g_hspi_last_selftest);

  if (len < 0)
    {
      return len;
    }

  return stm32u5x9j_diag_copyout(filep, buffer, buflen, text);
}

static ssize_t stm32u5x9j_hspi_diag_write(FAR struct file *filep,
                                          FAR const char *buffer,
                                          size_t buflen)
{
  char cmd[16];
  size_t ncopy;
  int ret;

  ncopy = MIN(buflen, sizeof(cmd) - 1);
  memcpy(cmd, buffer, ncopy);
  cmd[ncopy] = '\0';

  if (strncmp(cmd, "selftest", 8) != 0)
    {
      return -EINVAL;
    }

  ret = stm32u5x9j_hspi1_psram_initialize();
  if (ret == OK)
    {
      ret = stm32u5x9j_psram_selftest();
    }

  g_hspi_last_selftest = ret;
  return ret < 0 ? ret : (ssize_t)buflen;
}

static int stm32u5x9j_hspi_diag_register(void)
{
  int ret;

  if (g_hspi_diag_registered)
    {
      return OK;
    }

  ret = register_driver(STM32U5X9J_HSPI_DIAG_PATH, &g_hspi_diag_fops,
                        0666, NULL);
  if (ret < 0)
    {
      return ret;
    }

  g_hspi_diag_registered = true;
  syslog(LOG_INFO, "stm32u5x9j: HSPI1 PSRAM diagnostic at %s\n",
         STM32U5X9J_HSPI_DIAG_PATH);

  return OK;
}
#endif /* CONFIG_STM32U5X9J_DK_HSPI_DIAG */
#endif /* CONFIG_STM32U5X9J_DK_HSPI_RAM */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef CONFIG_STM32U5X9J_DK_OSPI_NOR
int stm32u5x9j_ospi1_nor_initialize(void)
{
  const struct stm32_xspi_config_s spi_config =
    {
      .port           = STM32_XSPI_PORT_OCTOSPI1,
      .memory_type    = XSPI_DCR1_MTYP_MICRON,
      .device_size    = MX25UM51245G_DEVSIZE,
      .csht           = STM32U5X9J_OSPI_CSHT,
      .prescaler      = STM32U5X9J_OSPI_PRESCALER,
      .fifo_threshold = STM32U5X9J_OSPI_FIFO_THRESHOLD,
      .maxtran        = 0,
      .csbound        = 0,
      .refresh        = 0,
    };

  const struct stm32_xspi_config_s dtr_config =
    {
      .port           = STM32_XSPI_PORT_OCTOSPI1,
      .memory_type    = XSPI_DCR1_MTYP_MACRONIX,
      .device_size    = MX25UM51245G_DEVSIZE,
      .csht           = STM32U5X9J_OSPI_CSHT,
      .prescaler      = STM32U5X9J_OSPI_PRESCALER,
      .fifo_threshold = STM32U5X9J_OSPI_FIFO_THRESHOLD,
      .maxtran        = 0,
      .csbound        = 0,
      .refresh        = 0,
    };

  uint8_t id[3] =
    {
      0
    };

  uint32_t first;
  int ret;

  if (stm32_xspi_is_mapped(STM32_XSPI_PORT_OCTOSPI1))
    {
      syslog(LOG_INFO, "stm32u5x9j: OSPI1 NOR already memory-mapped\n");
      return OK;
    }

  ret = stm32_xspi_common_setup();
  if (ret < 0)
    {
      return ret;
    }

  stm32u5x9j_ospi_gpio_config();

  ret = stm32_xspi_configure(&spi_config);
  if (ret < 0)
    {
      return ret;
    }

  stm32u5x9j_ospi_reset_opi(false);

  ret = stm32_xspi_configure(&dtr_config);
  if (ret == OK)
    {
      stm32u5x9j_ospi_reset_opi(true);
    }

  ret = stm32_xspi_configure(&spi_config);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_ospi_reset_spi();
  if (ret < 0)
    {
      syslog(LOG_ERR, "stm32u5x9j: OSPI1 NOR reset failed: %d\n", ret);
      return ret;
    }

  ret = stm32u5x9j_ospi_readid(id);
  if (ret < 0)
    {
      syslog(LOG_ERR, "stm32u5x9j: OSPI1 NOR read-id failed: %d\n", ret);
      return ret;
    }

