FeatherCore/nuttx/boards/arm/stm32u5/stm32u5x9j-dk/src/stm32u5x9j_xspi.c
  syslog(LOG_INFO, "stm32u5x9j: OSPI1 NOR JEDEC ID %02x %02x %02x\n",
         id[0], id[1], id[2]);

  memcpy(g_ospi_jedec, id, sizeof(g_ospi_jedec));

  if (stm32u5x9j_ospi_id_blank(id))
    {
      return -EIO;
    }

  ret = stm32u5x9j_ospi_enter_memory_mapped();
  if (ret < 0)
    {
      syslog(LOG_ERR, "stm32u5x9j: OSPI1 NOR map failed: %d\n", ret);
      return ret;
    }

  first = *(volatile uint32_t *)STM32U5X9J_OSPI1_NOR_MEM_BASE;
  syslog(LOG_INFO, "stm32u5x9j: OSPI1 NOR mapped at 0x%08x first=0x%08"
         PRIx32 "\n", STM32U5X9J_OSPI1_NOR_MEM_BASE, first);
  return OK;
}

#ifdef CONFIG_STM32U5X9J_DK_OSPI_DIAG
int stm32u5x9j_ospi_diag_initialize(void)
{
  int ret;

  ret = stm32u5x9j_ospi1_nor_initialize();
  if (ret < 0)
    {
      return ret;
    }

  return stm32u5x9j_ospi_diag_register();
}
#endif
#endif /* CONFIG_STM32U5X9J_DK_OSPI_NOR */

#ifdef CONFIG_STM32U5X9J_DK_HSPI_RAM
int stm32u5x9j_hspi1_psram_initialize(void)
{
  const struct stm32_xspi_config_s config =
    {
      .port           = STM32_XSPI_PORT_HSPI1,
      .memory_type    = XSPI_DCR1_MTYP_APMEM_16BIT,
      .device_size    = APS512XX_DEVSIZE,
      .csht           = STM32U5X9J_HSPI_CSHT,
      .prescaler      = STM32U5X9J_HSPI_PRESCALER,
      .fifo_threshold = STM32U5X9J_HSPI_FIFO_THRESHOLD,
      .maxtran        = STM32U5X9J_HSPI_MAXTRAN,
      .csbound        = STM32U5X9J_HSPI_CSBOUND,
      .refresh        = stm32u5x9j_psram_refresh(
                          STM32U5X9J_HSPI_PRESCALER),
    };

  int ret;

  if (stm32_xspi_is_mapped(STM32_XSPI_PORT_HSPI1))
    {
      g_hspi_ram_mapped = true;
      return OK;
    }

  g_hspi_ram_mapped = false;

  ret = stm32_xspi_common_setup();
  if (ret < 0)
    {
      return ret;
    }

  stm32u5x9j_hspi_gpio_config();
  ret = stm32_xspi_configure(&config);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32_xspi_command_addr(STM32_XSPI_PORT_HSPI1,
                                APS512XX_RESET_CMD, 0,
                                XSPI_CCR_IMODE_8_LINES |
                                XSPI_CCR_ADMODE_8_LINES |
                                XSPI_CCR_ADSIZE_24,
                                0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "stm32u5x9j: HSPI1 PSRAM reset failed: %d\n", ret);
      return ret;
    }

  up_mdelay(1);

  ret = stm32u5x9j_psram_config_reg(APS512XX_MR0_ADDRESS,
                                    APS512XX_MR0_VALUE, 0x3fu);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_psram_config_reg(APS512XX_MR4_ADDRESS,
                                    APS512XX_MR4_VALUE, 0xffu);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_psram_config_reg(APS512XX_MR8_ADDRESS,
                                    APS512XX_MR8_VALUE, 0x47u);
  if (ret < 0)
    {
      return ret;
    }

  ret = stm32u5x9j_psram_enter_memory_mapped();
  if (ret < 0)
    {
      return ret;
    }

  g_hspi_ram_mapped = true;

  ret = stm32u5x9j_psram_selftest();
#ifdef CONFIG_STM32U5X9J_DK_HSPI_DIAG
  g_hspi_last_selftest = ret;
#endif
  if (ret < 0)
    {
      g_hspi_ram_mapped = false;
      return ret;
    }

  syslog(LOG_INFO, "stm32u5x9j: HSPI1 PSRAM mapped at 0x%08x\n",
         STM32U5X9J_HSPI1_PSRAM_MEM_BASE);
  return OK;
}

bool stm32u5x9j_hspi1_psram_is_mapped(void)
{
  return g_hspi_ram_mapped &&
         stm32_xspi_is_mapped(STM32_XSPI_PORT_HSPI1);
}

#ifdef CONFIG_STM32U5X9J_DK_HSPI_DIAG
int stm32u5x9j_hspi_diag_initialize(void)
{
  int ret;

  ret = stm32u5x9j_hspi1_psram_initialize();
  if (ret < 0)
    {
      return ret;
    }

  return stm32u5x9j_hspi_diag_register();
}
#endif
#endif /* CONFIG_STM32U5X9J_DK_HSPI_RAM */

#endif /* OSPI NOR || HSPI RAM */
